Tekla Open API Reference for Tekla Structures 2025
ContainerElement.IsSynchronized Property
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsSynchronized { get; }
Public ReadOnly Property IsSynchronized As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection.IsSynchronized
See Also
Reference
ContainerElement Class
Tekla.Structures.Drawing Namespace